SecurityAlert
| summarize Alerts=count_distinct(SystemAlertId) by bin(TimeGenerated, 1d)
| sort by TimeGenerated asc
| join (
    SecurityIncident
    | summarize Incidents=count_distinct(IncidentNumber) by bin(TimeGenerated, 1d)
    | sort by TimeGenerated asc)
    on TimeGenerated
| project TimeGenerated, Alerts, Incidents

